//----------------------------------------------------------------------------//
//	파일 이름	: HTextern.h
//
//	파일 설명 	: 
//		- 전역변수에 대한 컨트롤을 한다.
//
//	작성자		:
//		- 2002/05/17, Created by Jung Eui Kyu
//
//  Copyright (c) 2000-2002 Hanbitsoft Corp.  All rights reserved.
//----------------------------------------------------------------------------//
#include "HTControlDef.h"

#include "HTCamera.h"

#include "HTConfigSystem.h"
#include "HTGameSystem.h"
#include "HT2DObjectMgr.h"
#include "HTAOI.h"
#include "HTSystem.h"
#include "HTInfoLoad.h"
#include "htmapinfo.h"
#include "HTLoading.h"
#include "HTWindowManager.h"
#include "HTFlocking.h"
// 공지 관련
#include "HTNotifyWindow.h"
#include "HTEventWindow.h"
// 캐릭터 관련
#include "htotherobjectsystem.h"
#include "HTGM.h"
#include "HTMainCharacter.h"
#include "htattackmanager.h"
#include "HitCountMgr.h"
// 네트워크 관련
#include "CPSock.h"
#include "TNNetworkManager.h"
#include "HTNetworkMsg.h"
#include "HTNetWorkHandle.h"
#include "HTChatNetWorkHandle.h"
#include "TNChatNetworkManager.h"
// 스킬 관련
#include "HTSkillSystem.h"
#include "HTSkillInventory.h"
// 기타 기능 관련
#include "HTChatting.h"
#include "HTParty.h"
#include "HTexchange.h"
#include "HTAddress.h"
#include "HTPortal.h"
#include "HTGuild.h"
#include "HTIndividualStore.h"
#include "HTRentalStore.h"
#include "HTDuelSystem.h"
// 인터페이스 관련
#include "HTInterface.h"		// Tantra V3 UI (2005. 7. 8 ZEDI)
//#include "htbelt.h"
#include "HTInterfaceCheck.h"
#include "HTStatus.h"
#include "HTGamble.h"			// Tantra V3 UI (윳놀이 UI 제어)
#include "HTChatRoom.h"			// 채팅
#include "HTObjectInfo.h"
#include "HTMainBar.h"
#include "HTQuickSlot.h"
#include "htcommand.h"
// 아이템 관련
#include "HTItemSystem.h"
#include "htitemcontrol.h"
#include "HTEquipInventory.h"
#include "HTEquipSystem.h"
// 몬스터 관련
#include "HTMonster.h"
#include "HTNPCSystem.h"
#include "HTNPCControl.h"
// 퀘스트 관련
#include "HTTutorialSystem.h"
#include "HTQuest.h"
// 데이터
#include "HTClientParamMgr.h"
#include "HTMessageMgr.h"
//	IME
#include "HTImeMgr.h"
//	Web
#include "HTWebInfo.h"



//-----------------------------------------------------------------------------//
//  설명 : 디버깅 메시지 출력
//  작성일자 / 작성자 : 2003.03.03 서명석 20030303Tenma
//-----------------------------------------------------------------------------//
#define HT_DEBUG_LOGFILE
HTvoid	HT_g_vOpenDebugFile();
HTvoid	HT_g_vLogFile( CHTString strTemp );
HTvoid	HT_g_vCloseDebugFile();

//-----------------------------------------------------------------------------//
//  설명 : 메인 게임
//  작성일자 / 작성자 : 2003.03.03 서명석 20030303Tenma
//-----------------------------------------------------------------------------//
extern CHTWindowManager*				g_CGame;

extern HT_INTERFACE_FLAG				g_iInterface;
extern HTfloat							g_imsi_button[7];
extern int								g_button_count;
extern HTbool							g_bHelp_Text;
extern CHTString						g_DebugingFont[10];
extern HTint							g_DebugingFont_Count;

extern CHTCamera						g_cCamera;
extern CHTNetworkMsg*					g_pNetMsg;

extern HTbool							g_bMainCharacterInitialized;
extern HTint							g_iGameSequnce;
extern BYTE								g_bOneTimeUpdate;
extern HTint							g_iGameBigSequnce;

//-----기본적인 정보-----//
extern HTInfoLoad*						g_BasicLoadingInfo;

//-----------------------------------------------------------------------------//
//  설명 : OtherObject 관리
//  작성일자 / 작성자 : 20040106 / 정의규
//-----------------------------------------------------------------------------//
extern HTOtherObjectSystem*				g_cOtherObjectSystem;

//-----------------------------------------------------------------------------//
//  설명 : 몬스터 / NPC
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTNPCSystem*						g_sNPCSystem;

//-----------------------------------------------------------------------------//
//  설명 : 메인 캐릭터
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTMainCharacter*					g_cMainCharacter;
extern HTAOI*							g_cAoi;
extern S_CHARACTER_LIST					g_oMainCharacterInfo;
extern BYTE								g_byCharacterServerTribe[8];
extern BYTE								g_byteMainCharacterCaste;		// 구조체에 추가할 수없어, 별도로 전역 선언사용 (계급)

//	이동속도
extern signed char				g_byteSpeed1, g_byteSpeed2, g_byteSpeed3;
extern signed char				g_byteSpeedCorrection;
extern signed char				g_byteSpeedParity;

//	공격속도 패킷
extern signed char					g_byteAS1, g_byteAS2, g_byteAS3, g_byteAS4;
extern signed char					g_byteParity;


//-----------------------------------------------------------------------------//
//  설명 : 인트로
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTIntroManager*					g_cIntroManager;

//-----------------------------------------------------------------------------//
//  설명 : 에디터에서 각종 데이타(스킬, 아이템, 몬스터, NPC, NPC 샆) 로딩
//  작성일자 / 작성자 : 김선미
//-----------------------------------------------------------------------------//
extern CHTClientParamMgr*				g_pParamMgr;
extern CHTParamIDCheck					HTPrarmIDCheck;
//-----------------------------------------------------------------------------//
//  설명 : 성공/실패 정보 메세지
//  작성일자 / 작성자 : 김선미
//-----------------------------------------------------------------------------//
extern CHTMessageMgr*					g_pMessageMgr;
//-----------------------------------------------------------------------------//
//  설명 : 스킬
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTSkillSystem*					g_cSkillSystem;

//-----------------------------------------------------------------------------//
//  설명 : 아이템 시스템
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTItemSystem*					g_cItemSystem;
extern HTItemControl*					g_cItemControl;

//-----------------------------------------------------------------------------//
//  설명 : 게임 시스템
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTGameSystem*					g_cGameSystem;

//-----------------------------------------------------------------------------//
//  설명 : 2D 스프라이트 메니져
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHT2DObjectMgr*					g_2DObjectMgr;

//-----------------------------------------------------------------------------//
//  설명 : 네트워크 메니져
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern TNNetworkManager*				g_pNetWorkMgr;
extern CPSock							g_cCPSock;

extern TNChatNetworkManager*			g_pChatNetWorkMgr;
extern CPSock							g_cChatCPSock;	// 성회 추가 (2005.12.19)

//-----------------------------------------------------------------------------//
//  설명 : 채팅에 관련하여
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTChatting*						g_cChatting;					// 대호 수정 (2002.09.16)

//-----------------------------------------------------------------------------//
//  설명 : 초기화 정보를 내려받았는지 체크
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern DWORD							g_cInitConntion_StartTime;

//-----------------------------------------------------------------------------//
//  설명 : 캐릭터 장착 시스템
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTEquipSystem*					g_cEquipSystem;

//-----------------------------------------------------------------------------//
//  설명 : 게임 시스템 인벤토리 관련 부분_스킬
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTSkillInventory*				g_cSkillInventory;
extern CHTEquipInventory*				g_cEquipInventory;

//-----------------------------------------------------------------------------//
//  설명 : 캐릭터 스테이터스 관련
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTStatus*						g_cStatus;


//-----------------------------------------------------------------------------//
//  설명 : 캐릭터 UI 윈도우 관련 (카타나2 확장버전)
//  작성일자 / 작성자 : 선영범
//-----------------------------------------------------------------------------//
extern CHTUIStatus						*g_cUIStatus;		// 상태창
extern CHTUINPCWindow					*g_cUINPCWindow;		// NPC 대화창
extern CHTUISkillWindow					*g_cUISkillWindow;	// 스킬창
extern CHTUIRefineWindow				*g_cUIRefineWindow;	// 제련창
extern CHTUIQuestWindow					*g_cUIQuestWindow;	// 퀘스트창
extern CHTUIMerchantWindow				*g_cUIMerchantWindow;// 마켓창
extern CHTUIEmblemWindow				*g_cUIEmblemWindow;	// 앰블램


//-----------------------------------------------------------------------------//
//  설명 : 도박 관련
//  작성일자 / 작성자 : 선영범 (Only Tantra V3 UISystem)
//-----------------------------------------------------------------------------//
extern HTGamble*						g_cGamble;

//-----------------------------------------------------------------------------//
//  설명 : 채팅 관련
//  작성일자 / 작성자 : 선영범 (Only Tantra V3 UISystem)
//-----------------------------------------------------------------------------//
extern HTChatRoom*						g_cChatRoom;

//-----------------------------------------------------------------------------//
//  설명 : 공성전
//  작성일자 / 작성자 : 20050812 / 정의규
//-----------------------------------------------------------------------------//
extern HTSiege*							g_pSiege;

//-----------------------------------------------------------------------------//
//  설명 : 파티
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTParty*							g_cParty;

//-----------------------------------------------------------------------------//
//  설명 : 주소록
//  작성일자 / 작성자 : 2002_12_16 / 정의규
//-----------------------------------------------------------------------------//
extern HTAddress*						g_cAddress;

//-----------------------------------------------------------------------------//
//  설명 : 인터페이스 클래스
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern CHTInterfaceCheck*				g_cInterfaceCheck;

//-----------------------------------------------------------------------------//
//  설명 : 교환 시스템
//  작성일자 / 작성자 : 2002.11.02_정의규
//-----------------------------------------------------------------------------//
extern HTExchange*						g_cExchangeSystem;

//-----------------------------------------------------------------------------//
//  설명 : 퀘스트 시스템
//  작성일자 / 작성자 : 2003.04.16_정의규
//-----------------------------------------------------------------------------//
extern CHTMiniMap*						g_cMiniMap;

//-----------------------------------------------------------------------------//
//  설명 : 퀘스트 시스템
//  작성일자 / 작성자 : 2002.11.29_정의규
//-----------------------------------------------------------------------------//
extern HTQuest*							g_cQuest;

//-----------------------------------------------------------------------------//
//  설명 : 시스템
//  작성일자 / 작성자 : 2002.11.29_정의규
//-----------------------------------------------------------------------------//
extern HTSystem*						g_cSystem;

//-----------------------------------------------------------------------------//
//  설명 : 정보창
//  작성일자 / 작성자 : 2002.12.27_김선미
//-----------------------------------------------------------------------------//
extern HTObjectInfo*					g_cObjectInfo;

//-----------------------------------------------------------------------------//
//  설명 : 맵정보 활용
//  작성일자 / 작성자 : 2003.01.11_정의규
//-----------------------------------------------------------------------------//
extern HTMapInfo*						g_cMapInfo;

//-----------------------------------------------------------------------------//
//  설명 : Config System
//  작성일자 / 작성자 : 2003.01.13_Tenma
//-----------------------------------------------------------------------------//
extern CHTConfigSystem*					g_pCfgSys;

//-----------------------------------------------------------------------------//
//  설명 : Window handler, Instance handler
//  작성일자 / 작성자 : 2003.01.13_Tenma
//-----------------------------------------------------------------------------//
extern HWND								g_hWnd;
extern HINSTANCE						g_hInstance;

//-----------------------------------------------------------------------------//
//  설명 : SCP_INIT_CHAR 시의 Initialize Time (서버 클라이언트 모두)를 저장
//  작성일자 / 작성자 : 2003.01.22_Tenma
//-----------------------------------------------------------------------------//
extern time_t							g_tInitServerTime;
extern time_t							g_tInitClientTime;

//-----------------------------------------------------------------------------//
//  설명 : 개발중인지 아니면 유저들이 사용하는 모드인지를 체크한다.
//         일단은 실행 시 커맨드라인의 -netscript가 있는지를 판별하여 체크한다.
//		   -netscrpit가 있으면 HT_TRUE롤 바꾼다.
//  작성일자 / 작성자 : 2003.02.04_Tenma
//-----------------------------------------------------------------------------//
extern HTint							g_bDevelopingMode;
extern HTbool							g_bTransparencyMode;

//-----------------------------------------------------------------------------//
//  설명 : 공지사항 창
//  작성일자 / 작성자 : 2003.02.14Tenma
//-----------------------------------------------------------------------------//
extern CHTNotifyWindow*					g_pNotifyWindow;

//-----------------------------------------------------------------------------//
//  설명 : 메인 바
//  작성일자 / 작성자 : 2003.03.07Tenma
//-----------------------------------------------------------------------------//
extern CHTMainBar*						g_pMainBar;

//-----------------------------------------------------------------------------//
//  설명 : 메인UISystem
//  작성일자 / 작성자 : 2003.02.20 / 정의규
//-----------------------------------------------------------------------------//
extern CHTUIManager*					g_cUIManager;

//-----------------------------------------------------------------------------//
//  설명 : 포탈 / 워프
//  작성일자 / 작성자 : 2003.02.20 / 정의규
//-----------------------------------------------------------------------------//
extern HTPortal*						g_cPortal;
extern HTbool							g_bZoneServerSwitching;
extern HTbool							g_bPortalServerConnectCheckSw;
extern HTbool							g_bPortalServerDisConnectCheckSw;
extern WORD								g_wResentZoneServerID;
extern HTint							g_wFirstZoneServerID;
extern WORD								g_wPotalID;
extern WORD								g_wWalf;
extern BYTE								g_byInitConnectType;
extern HTbyte							g_byIsDeadInit;

//-----------------------------------------------------------------------------//
//  설명 : 로딩_언로딩 함수군
//  작성일자 / 작성자 : 2003.02.27Tenma
//-----------------------------------------------------------------------------//
extern CHTLoading*						g_cLoading;

//-----------------------------------------------------------------------------//
//  설명 : 서버에 초기화 정보 요청 횟수
//  작성일자 / 작성자 : 2003.02.28Tenma
//-----------------------------------------------------------------------------//
extern HTint							g_iRequestCharacterInitCount;

//-----------------------------------------------------------------------------//
//  설명 : GM
//  작성일자 / 작성자 : 2004.04.22 / 정의규
//-----------------------------------------------------------------------------//
extern HTGM*							g_cGMSystem;

//-----------------------------------------------------------------------------//
//  설명 : 컬러테이블
//  작성일자 / 작성자 : 2003.02.07Tenma
//-----------------------------------------------------------------------------//
extern HT_COLOR						g_ColorTable[19];

//-----------------------------------------------------------------------------//
//  설명 : 애니매이션 테이블
//  작성일자 / 작성자 : 2004.01.07 / 의규
//-----------------------------------------------------------------------------//
extern HTint g_EtcAnmIndex[14];

//-----------------------------------------------------------------------------//
//  설명 : 플레이영상 촬영 위하여
//  작성일자 / 작성자 : 2003.03.04Tenma  20030304Tenma_test
//-----------------------------------------------------------------------------//
extern HTbool							g_bGamePlayMovieForGlobal;
extern HTbool							g_bUseEngineCamera;
extern HTbool							g_bGoAttackCamera;

//-----------------------------------------------------------------------------//
//  설명 : 상거래( 사고, 팔고, 수리 등등 ), 챠크라 시스템
//  작성일자 / 작성자 : 2003.04.21 김선미
//-----------------------------------------------------------------------------//
extern CHTNPCControl*					g_cNPCControl;

//-----------------------------------------------------------------------------//
//  설명 : 공격 클래스 컨트롤
//  작성일자 / 작성자 : 2003.4.21 정의규
//-----------------------------------------------------------------------------//
extern HTAttackManager*					g_cAttackMgr;

//-----------------------------------------------------------------------------//
//  설명 : Hit Demage 클래스 컨트롤
//  작성일자 / 작성자 : 2003.11.26 정의규
//-----------------------------------------------------------------------------//
extern HitCountMgr*						g_cHitCountMgr;

//-----------------------------------------------------------------------------//
//  설명 : 튜토리얼 시스템
//  작성일자 / 작성자 : 2003.8.1 정의규
//-----------------------------------------------------------------------------//
extern HTTutorialSystem*				g_cTutorialSystem;

//-----------------------------------------------------------------------------//
//  설명 : 길드 시스템
//  작성일자 / 작성자 : 2003.8.14 정의규
//-----------------------------------------------------------------------------//
extern HTGuild*							g_cGuildSystem;
extern HTbool							g_bGuildMarkShow;
extern HTbool							g_bTrimuritiShow;

//-----------------------------------------------------------------------------//
//  설명 : 퀵스킬 창
//  작성일자 / 작성자 : 2003.9.17 정의규
//-----------------------------------------------------------------------------//
extern HTQuickSlot*						g_cQuickSlot;

//-----------------------------------------------------------------------------//
//  설명 : 명령창 처리
//  작성일자 / 작성자 : 정의규 20040124
//-----------------------------------------------------------------------------//
extern HTCommand*						g_cCommand;

//-----------------------------------------------------------------------------//
//  설명 : 캐리터 이동 스피드 저장
//  작성일자 / 작성자 : 2004.07.15 정의규
//-----------------------------------------------------------------------------//
extern HTint							g_iMemoryCharMoveSpeed5;

// HK : 개발 테스트를 위해 치트키들
struct HTDebugCheat
{
	HTDebugCheat()
	{
		g_bShowFPS = HT_FALSE;
	}

	HTbool g_bShowFPS;
};

extern HTDebugCheat g_bShowFPS;

//-----------------------------------------------------------------------------//
//  설명 : ID / PASSWORD / 월드 리스트
//  작성일자 / 작성자 : 정의규
//-----------------------------------------------------------------------------//
extern HTint						g_iLoginResultID;
extern HTbool						g_bPCRoomEventWndLogo;
extern HTdword						g_dwMyEvent;
extern CHTString					g_strLoginID;
extern CHTString					g_strLgoinPasswordMD5;
extern CHTString					g_strLgoinPasswordMD5Plus;
extern WORLDLIST					g_oWorldList[MAX_SERVERGROUP][MAX_SERVER];		// 각 월드의 정보
extern HTint						g_iWorldNum;
extern CHTString					g_strZoneServerIP;
extern HTshort						g_snResentZoneSiege;
extern HTint						g_iZoneServerPort;
extern HTint						g_iConnectServerGroupIndex;					//	선택한 서버 그룹
extern CHTString					g_strSelectServerName;						//	서택한 서버 이름

//	두벡터를 이용하여 라디안 값을 얻어온다.
HTfloat HT_extern_fGetRidan(HTvector3 A, HTvector3 B);
//	Returns Cur TargetToResentTerm
HTfloat HT_extern_fGetDisForTwoPoint( HTvector3 vecTargetPos, HTvector3 vecSourcePos );
//	주신전 지역 판별
HTRESULT HT_extern_TrimuritiZone( HTint iZone );
//	요새전 지역 판별
HTRESULT HT_extern_ForetressZone( HTint iZone );

//-----------------------------------------------------------------------------//
//  설명 : 하늘을 나는 새
//  작성일자 / 작성자 : 정기석 20031219
//-----------------------------------------------------------------------------//
extern CHTFlocking*					g_pFlocking;

extern HTint						m_giBGM;

//-----------------------------------------------------------------------------//
//  설명 : Test/Main Server 
//  작성일자 / 작성자 : 정의규 / 20040126
//-----------------------------------------------------------------------------//
extern HTint						g_gServerType;

//-----------------------------------------------------------------------------//
//  설명 : 개인 상점
//  작성일자 / 작성자 : 김선미 / 20040202
//-----------------------------------------------------------------------------//
extern CHTIndividualStore*			g_cIndividualStore;


//-----------------------------------------------------------------------------//
//  설명 : 위탁 상점
//  작성일자 / 작성자 : 선영범 / 20051012
//-----------------------------------------------------------------------------//
extern CHTRentalStore*				g_cRentalStore;


//-----------------------------------------------------------------------------//
//  설명 : initChar를 두번 받을 수 있는 경우를 예방하기 위해
//  작성일자 / 작성자 : 정의규 / 20040211
//-----------------------------------------------------------------------------//
extern HTint						g_iInitCharSW;

//-----------------------------------------------------------------------------//
//  설명 : 화면안의 모든 UI를 보이게 할것인지 안보이게 할것인지 결정
//  작성일자 / 작성자 : 정의규 / 20040214
//-----------------------------------------------------------------------------//
extern HTbool						g_bShowUI;
extern HTint						g_iShowUI;

//-----------------------------------------------------------------------------//
//  설명 : 이벤트 관련 팝업 창
//  작성일자 / 작성자 : 2004.04.12 김선미
//-----------------------------------------------------------------------------//
extern CHTEventWindow*					g_pEventWindow;

//-----------------------------------------------------------------------------//
//  설명 : 결투 시스템
//  작성일자 / 작성자 : 2004.12.14 정의규
//-----------------------------------------------------------------------------//
extern HTDuelSystem*					g_pDuelSystem;

//-----------------------------------------------------------------------------//
//  설명 : IME String
//  작성일자 / 작성자 : 2004.06.22 정의규
//-----------------------------------------------------------------------------//
extern HTImeMgr							g_cImeMgr;
extern HTbool							g_bShowCompStrSw;
extern CHTString						g_strImeName;
extern CHTString						g_strResultText;
extern CHTString						g_strCompStr;
extern CHTString						g_strCompReadStr;
extern CHTString						g_strCandidateList[10];
extern HTint							g_iCandiSelectionNo;
extern HTint							g_idwCandidateListNo;
extern HTbool							g_bSkipMessageOnChar;
extern HTvector3						g_vecCompStrPos;			//	IME Comp String Pos

//-----------------------------------------------------------------------------//
//  설명 : 국가코드
//  작성일자 / 작성자 : 정의규 / 20040823
//-----------------------------------------------------------------------------//
extern HTint							g_iInationalCode;
extern HTint							g_iInationalType;

//-----------------------------------------------------------------------------//
//  설명 : 웹 커넥트
//  작성일자 / 작성자 : 정의규 / 20040023
//-----------------------------------------------------------------------------//
extern CHTWebLogIn*						g_poWebLogIn;

//-----------------------------------------------------------------------------//
//  설명 : 빌링 서버 받은 결과
//  작성일자 / 작성자 : 2005.03.31
//-----------------------------------------------------------------------------//
extern HTbool							g_bReciveBillingServer;

//-----------------------------------------------------------------------------//
//  설명 : 카메라 이동상황을 체크해줌
//  작성일자 / 작성자 : 2005.08.14
//-----------------------------------------------------------------------------//
extern HTbool							g_bCameraMove;

//-----------------------------------------------------------------------------//
//  설명 : 아쉬람 마크 칼라값,
//  작성일자 / 작성자 : 2005.09.13
//-----------------------------------------------------------------------------//
extern HT_COLOR AMBLEM_COLOR[72];

//-----------------------------------------------------------------------------//
//  설명 : 스크립트로부터 메시지를 얻어와서 셋팅해준다.
//  작성일자 / 작성자 : 정의규 / 20041018
//-----------------------------------------------------------------------------//
extern HTvoid HT_g_Script_SetMessage( HTint idMessage, CHTString* pszMessage, CHTString strInputItem1 = _T(""), CHTString strInputItem2 = _T("") );

// Blog 관련 변수
enum HTEBlogAccessStatus
{
	HT_BLOGACCESSSTATUS_NULL,
	HT_BLOGACCESSSTATUS_READY,
};
extern HTEBlogAccessStatus g_eBlogAccessStatus;
extern HTint g_iBlogClickedChar;


//-----------------------------------------------------------------------------//
//  설명 : 우리의 숙원사업 ReStart
//  작성일자 / 작성자 : 정의규 / 20041121
//-----------------------------------------------------------------------------//
extern HTbyte							g_byReStartCode;
extern HTbyte							g_byReStartButtonCode;

//-----------------------------------------------------------------------------//
//  설명 : 버젼 체크
//  작성일자 / 작성자 : 정의규 / 20050311
//-----------------------------------------------------------------------------//
extern HTshort							g_snVersionCheck[4];

//-----------------------------------------------------------------------------//
//  설명 : 캐릭터 이름과 길드이름에서 사용해서는 안될 문자
//  작성일자 / 작성자 : 정의규 / 20040023
//-----------------------------------------------------------------------------//
#define NOTCHARANDGUILDNAME_COUNT		180
extern char g_szNotCharAndGuildName[NOTCHARANDGUILDNAME_COUNT][3];
//	캐릭명이나 길드이름으로 불가한 파일 로딩
extern HTvoid  HT_g_LoadNotCharAndGuildName();

extern FILE* g_pDebugFile;
